Revit 2026 API

# GradientGradientPosition Property

---

The property labeled "Position" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientPosition { get; }
```
```vb
Public Shared ReadOnly Property GradientPosition As String
	Get
```
```cpp
public:
static property String^ GradientPosition {
	String^ get ();
}
```
```fsharp
static member GradientPosition : string with get
```

#### Property Value

String

This property is a "AssetPropertyList" of type "AssetPropertyDouble".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace